---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarFreeFormHookEndPlaneAngle
source: html/45eb4e2a-6e9d-d9c1-a9dd-39f6eb76fc97.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarFreeFormHookEndPlaneAngle Property

"Hook Orientation At End"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarFreeFormHookEndPlaneAngle { get; }
```